#+title: C timestamp functions for XSB
#+author: Mark Clements

#+options: toc:nil html-postamble:nil num:nil

* Introduction

XSB is a capable Prolog/Datalog implementation which allows for easy integration with C functions. This package defines a set of functions for using some of the C date-time functions in XSB.

To use the =timestamp= module, put the =timestamp.c= and =timestamp.H= files into the current working directory or into one of the directories defined by =library_directory(Dir)= (see section 3.6 of the XSM Manual 1).

As a simple example, we have the following [[https://github.com/mclements/xsb-timestamp/blob/main/test_timestamp.P][test_timestamp.P]] file:

#+BEGIN_SRC shell :exports results :results verbatim
  cat test_timestamp.P
#+END_SRC

#+RESULTS:
#+begin_example
:- import localdatetime/1, to_timestamp/3, from_date/2, timestamps_age/3, from_timestamp/3, to_date/2,
   to_days/2 from timestamp.

test :-
      TS is 0, to_date(TS, Date),
      writeln('OriginDate'=Date), fail.

test :-
      to_timestamp('1970-01-01','%Y-%m-%d', TS), localdatetime(Now), timestamps_age(Now, TS, Age),
      writeln('AgeFromOrigin'=Age), fail.

test :-
      localdatetime(Now), from_timestamp(Now, '%Y-%m-%d %H:%M:%S', DateTime),
      writeln('DateTimeNow'=DateTime), fail.

test:-
     localdatetime(Now), to_date(Now, Date),
     writeln('DateNow'=Date), fail.

test :-
      localdatetime(Now), to_days(Now, Days),
      writeln('DaysFromOrigin'=Days), fail.

?- test; true.
#+end_example

We can run this using:

#+BEGIN_SRC bash :exports both :results output
  xsb timestamp
  xsb test_timestamp
#+END_SRC

#+RESULTS:
: OriginDate = 1970-01-01
: AgeFromOrigin = 51
: DateTimeNow = 2021-07-21 11:03:30
: DateNow = 2021-07-21
: DaysFromOrigin = 18829

Documentation is available in the [[https://github.com/mclements/xsb-timestamp/blob/main/timestamp.c][timestamp.c]] file.
